<h2>Topic 7</h2>
<h3>1. Missing Data p1</h3>
<p>Replace values with NAN values</p>

In [3]:
import pandas as pd
import numpy as np
myseries = pd.Series(['one','two',np.nan,'four',None,"Six"])
myseries

0     one
1     two
2     NaN
3    four
4    None
5     Six
dtype: object

In [4]:
myseries.isnull()

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [5]:
myseries[myseries.notnull()]

0     one
1     two
3    four
5     Six
dtype: object

In [6]:
myseries.dropna()

0     one
1     two
3    four
5     Six
dtype: object

In [7]:
newseries = myseries.dropna()
newseries

0     one
1     two
3    four
5     Six
dtype: object

In [9]:
from numpy import nan as NA
df = pd.DataFrame(np.random.rand(2,2))
df

          0         1
0  0.383817  0.349902
1  0.569895  0.867298

In [16]:
df.iloc[1,1] = NA
df.dropna()
df

    0         1
0 NaN  0.349902
1 NaN       NaN

In [18]:
df = pd.DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.574888  0.662072  0.750551  0.172617  0.265148
1  0.920455  0.094444  0.279663  0.658213  0.769181
2  0.749811  0.810176  0.435099  0.983211  0.079770
3  0.453796  0.882771  0.179421  0.316947  0.457510
4  0.428276  0.027850  0.229015  0.014248  0.565436

In [24]:
df[df.iloc[:2]>=0.5] = np.nan
df

          0         1         2         3         4
0       NaN       NaN       NaN  0.172617  0.265148
1       NaN  0.094444  0.279663       NaN       NaN
2       NaN       NaN  0.435099       NaN  0.079770
3  0.453796  0.882771  0.179421  0.316947  0.457510
4  0.428276  0.027850  0.229015  0.014248  0.565436

<h3>2. Missing Data p2</h3>
<p>Replace NAN values with other values</p>

In [25]:
df = pd.DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.747860  0.908695  0.142244  0.079630  0.344045
1  0.906544  0.740502  0.589817  0.927238  0.346552
2  0.779101  0.860275  0.617430  0.249606  0.365603
3  0.629609  0.042430  0.097102  0.379304  0.903190
4  0.633958  0.776411  0.505132  0.261035  0.716765

In [26]:
df[df.iloc[0:5] > 0.9] = np.nan
df

          0         1         2         3         4
0  0.747860       NaN  0.142244  0.079630  0.344045
1       NaN  0.740502  0.589817       NaN  0.346552
2  0.779101  0.860275  0.617430  0.249606  0.365603
3  0.629609  0.042430  0.097102  0.379304       NaN
4  0.633958  0.776411  0.505132  0.261035  0.716765

In [31]:
# df[number] represents the column
print(df[2].isnull().sum())

0

In [32]:
df.replace(np.nan,0)

          0         1         2         3         4
0  0.747860  0.000000  0.142244  0.079630  0.344045
1  0.000000  0.740502  0.589817  0.000000  0.346552
2  0.779101  0.860275  0.617430  0.249606  0.365603
3  0.629609  0.042430  0.097102  0.379304  0.000000
4  0.633958  0.776411  0.505132  0.261035  0.716765

In [33]:
# replace values with the average of the column
df.fillna(df.mean(), inplace=True)
df

          0         1         2         3         4
0  0.747860  0.604905  0.142244  0.079630  0.344045
1  0.697632  0.740502  0.589817  0.242394  0.346552
2  0.779101  0.860275  0.617430  0.249606  0.365603
3  0.629609  0.042430  0.097102  0.379304  0.443241
4  0.633958  0.776411  0.505132  0.261035  0.716765

In [34]:
values = df.values
values

array([[0.74785987, 0.60490455, 0.14224419, 0.07962954, 0.34404488],
       [0.697632  , 0.74050166, 0.58981653, 0.24239361, 0.34655178],
       [0.77910091, 0.860275  , 0.61743015, 0.24960587, 0.36560286],
       [0.62960892, 0.04243035, 0.09710173, 0.37930437, 0.44324108],
       [0.63395831, 0.77641117, 0.50513207, 0.26103466, 0.71676478]])

<h3>3. Missing Data p3</h3>
<p>Replace NAN values with the most frequency value</p>

In [35]:
df = pd.DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.677075  0.626850  0.231733  0.821484  0.610713
1  0.725046  0.673966  0.300080  0.081244  0.533760
2  0.011572  0.595180  0.212889  0.125797  0.679529
3  0.585348  0.555368  0.384845  0.248069  0.051442
4  0.336254  0.781756  0.709432  0.042076  0.012922

In [40]:
df[df.iloc[0:5] > 0.7] = np.nan
values = df.values
df

          0         1         2         3         4
0  0.677075  0.626850  0.231733       NaN  0.610713
1       NaN  0.673966  0.300080  0.081244  0.533760
2  0.011572  0.595180  0.212889  0.125797  0.679529
3  0.585348  0.555368  0.384845  0.248069  0.051442
4  0.336254       NaN       NaN  0.042076  0.012922

In [44]:
from numpy import isnan
from numpy import nan
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=nan, strategy="most_frequent")
transformed_values = imputer.fit_transform(values)
transformed_values

array([[0.67707452, 0.62685033, 0.23173284, 0.04207598, 0.61071342],
       [0.01157223, 0.67396571, 0.30008043, 0.08124449, 0.53376029],
       [0.01157223, 0.59517985, 0.21288869, 0.12579747, 0.67952874],
       [0.58534782, 0.55536769, 0.3848451 , 0.24806897, 0.05144184],
       [0.33625414, 0.55536769, 0.21288869, 0.04207598, 0.0129223 ]])